/*
** EPITECH PROJECT, 2022
** my_fast_a_tool
** File description:
** requirement.c
*/

#include <stdlib.h>
#define 🚪 static
#define 🆚 if
#define 🇺🇸 int
#define 🈹 char
#define 😼 const
#define 😡 void
#define 🙊 while
#define 🙏 return
#define 🚢 else
#define 🚧 for
#define 😋 NULL
#define 😖 malloc
#define 😤 sizeof
#define 🙈 {
#define 🙉 }
#define 😰 (
#define 😱 )
#define 😲 =
#define 😷 >=
#define 😸 <=
#define 🙅 ==
#define 🙆 *
#define 🙎 ++
#define 🚇 ;
#define 🚏 !=
#define 🚻 0
#define 🇰🇷 1
#define 🌠 [
#define 🌵 ]
#define 🌸 ||
#define 🌺 -
#define 🍀 +
#define 🍄 &&
#define 🍎 '\0'
#define 🍑 ,
#define 🍔 <
#define 🍤 97
#define 🍦 122
#define 🎃 32
#define 🎈 65
#define 🎒 90
#define 🎳 49
#define 🎻 57

🚪 🇺🇸 😻 😰 🈹 😼 🙆 🇨🇳 😱 🙈
    🇺🇸 🆘 😲 🚻 🚇

    🙊 😰 🙆 🇨🇳 😱 🙈
        🆘 🙎 🚇
        🙆 🇨🇳 🙎 🚇
    🙉
    🙏 😰 🆘 😱 🚇
🙉

🚪 🈹 🙀 😰 🈹 🚼 😱 🙈
    🆚 😰 🚼 😷 🍤 🍄 🚼 😸 🍦 😱
        🚼 😲 🚼 🌺 🎃 🚇
    🙏 🚼 🚇
🙉

🚪 🇺🇸 🚽 😰 🈹 😼 🚨 😱 🙈
    🆚 😰 🚨 😷 🎳 🍄 🚨 😸 🎻 😱
        🙏 🇰🇷 🚇
    🆚 😰 🚨 😷 🎈 🍄 🚨 😸 🎒 😱
        🙏 🇰🇷 🚇
    🆚 😰 🚨 😷 🍤 🍄 🚨 😸 🍦 😱
        🙏 🇰🇷 🚇
    🙏 🚻 🚇
🙉

🚪 😡 🚬 😰 🈹 😼 🙆 😏 🍑 🈹 🙆 😭 🍑 🇺🇸 🛀 😱 🙈
    🆚 😰  😏 🌠 🛀 🌺 🇰🇷 🌵 🚏 🍎 😱
        🆚 😰 🚽 😰 😏 🌠 🛀 🌺 🇰🇷 🌵 😱 🚏 🇰🇷 😱
            😭 🌠 🛀 🌵 😲 🙀 😰 😏 🌠 🛀 🌵 😱 🚇
        🚢
            😭 🌠 🛀 🌵 😲 😏 🌠 🛀 🌵 🚇
    🚢
        😭 🌠 🛀 🌵 😲 🙀 😰 😏 🌠 🛀 🌵 😱 🚇
🙉

🈹 🙆 my_strcapitalize_synthesis 😰 🈹 🙆 💦 😱
🙈
    🇺🇸 ඞ 😲 😻 😰 💦 😱 🚇
    🈹 🙆 🍺 😲 😖 😰 😤 😰 🈹 😱 🙆 😰 ඞ 🍀 🇰🇷 😱 😱 🚇

    🆚 😰 🍺 🙅 😋 🌸 💦 🙅 😋 🌸 ඞ 🙅 🚻 😱
        🙏 😋 🚇
    🚧 😰 🇺🇸 😂 😲 🚻 🚇 😂 🍔 ඞ 🌸 💦 🌠 😂 🌵 🚏 🍎 🚇 😂 🙎 😱
        🚬 😰 💦 🍑 🍺 🍑 😂 😱 🚇
    🙏 🍺 🚇
🙉
